#!/usr/bin/env python
# _*_ coding:utf-8 _*_

'''
    切片
'''

print("=============================list切片========================")

l = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

# 取前9个元素
print(l[:9])
# 取第2-6个元素
print(l[1:6])
# 1-12的元素每2个取一个
print(l[1:12:2])
# 所有元素，每隔3个取一个
print(l[::3])
# 复制整个列表
print(l[:])

print("\n=============================tuple切片========================")

t = (14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26)

# 取前9个元素
print(t[:9])
# 取第4-6个元素
print(t[3:6])
# 6-12的元素每2个取一个
print(t[6:12:2])
# 所有元素，每隔3个取一个
print(t[::3])
# 复制整个元组
print(t[:])

print("\n=============================字符串切片========================")

s = "今天的天气真好啊好的我都想出去啷哩咯啷"

# 取前9个元素
print(s[:9])
# 取第4-6个元素
print(s[3:6])
# 6-12的元素每2个取一个
print(s[6:12:2])
# 所有元素，每隔3个取一个
print(s[::3])
# 复制整个字符串
print(s[:])
